In [5]:
# Creating CSV File using 'x' mode
# r -> read
# x -> create
# w -> write
# a -> append

try:
    file = open('Data\info.csv','x')
    file.close()
except:
    print("The file is already there")

The file is already there

In [4]:
# !pip install pandas
import pandas as pd
df = pd.read_csv('Data\info.csv',nrows = 4)
df

   sn      name  age           add       phone
0   1    Zenith   21     Kathmandu  6789998212
1   2  Maharjan   21          Teku  9841220202
2   3  Jubilant   12      Kalimati   984523123
3   4    School   17  Bhimsensthan     4212343

In [6]:
# !pip install pandas
import pandas as pd
df = pd.read_csv('Data\info.csv')
df.head()

   sn      name  age           add       phone
0   1    Zenith   21     Kathmandu  6789998212
1   2  Maharjan   21          Teku  9841220202
2   3  Jubilant   12      Kalimati   984523123
3   4    School   17  Bhimsensthan     4212343
4   5      Home   23      Dalachhi    21732313

In [4]:
df. tail(3)

   sn     name  age           add       phone
3   4   School   17  Bhimsensthan     4212343
4   5     Home   23      Dalachhi    21732313
5   6  Current    3         Bafal  9803012310

In [8]:
import pandas as pd
df = pd.read_csv('Data\info.csv', index_col = 'sn' , usecols = ['sn' , 'name' , 'add'])
df

        name           add
sn
1     Zenith     Kathmandu
2   Maharjan          Teku
3   Jubilant      Kalimati
4     School  Bhimsensthan
5       Home      Dalachhi
6    Current         Bafal

In [9]:
# iloc -> filters row and columns with respect to index
df = pd.read_csv('Data\info.csv')
df.iloc[1:4]

   sn      name  age           add       phone
1   2  Maharjan   21          Teku  9841220202
2   3  Jubilant   12      Kalimati   984523123
3   4    School   17  Bhimsensthan     4212343

In [10]:
df = pd.read_csv('Data\info.csv')
df.iloc[1:4,0:3]

   sn      name  age
1   2  Maharjan   21
2   3  Jubilant   12
3   4    School   17

In [12]:
# loc -> filters row and columns with respect to values
import pandas as pd
df = pd.read_csv('Data\info.csv', index_col = 'sn')
df.loc[1:5, 'name':'add']

        name  age           add
sn
1     Zenith   21     Kathmandu
2   Maharjan   21          Teku
3   Jubilant   12      Kalimati
4     School   17  Bhimsensthan
5       Home   23      Dalachhi

In [9]:
# filtering using condition

df[['name','add']]

        name           add
sn
1     Zenith     Kathmandu
2   Maharjan          Teku
3   Jubilant      Kalimati
4     School  Bhimsensthan
5       Home      Dalachhi
6    Current         Bafal

In [10]:
df['name'] == 'Zenith'

sn
1     True
2    False
3    False
4    False
5    False
6    False
Name: name, dtype: bool

In [11]:
df[df['name'] == 'Zenith']

      name  age        add       phone
sn
1   Zenith   21  Kathmandu  6789998212

In [12]:
df[(df['age'] > 20) & (df['add'] == 'Kathmandu')]

      name  age        add       phone
sn
1   Zenith   21  Kathmandu  6789998212

In [17]:
# Filtering and Saving Files
data = df[(df['age'] > 20) & (df['add'] == 'Kathmandu')]
data.to_csv('Data\new_data.csv')

In [19]:
import pandas as pd

data = {'name' : ['Ram','Shyam','Hari'],
        'age' : [34,56,34],
        'add' : ['Kathmandu' , 'Bhaktapur' , 'Lalitpur']}
df = pd.DataFrame(data)
df.to_csv('Data\user_info.csv')
df

In [25]:
df = pd.read_csv('Data/user_info.csv' , index_col = 'sn')
df

     name  age        add
sn
0     Ram   34  Kathmandu
1   Shyam   56  Bhaktapur
2    Hari   34   Lalitpur

In [11]:
data = [['name','age','add'],
        ['Ram' , 34 , 'Kathmandu'],
        ['Shyam', 56 , 'Bhaktapur'],
        ['Hari', 34 , 'Lalitpur']]
data

[['name', 'age', 'add'],
 ['Ram', 34, 'Kathmandu'],
 ['Shyam', 56, 'Bhaktapur'],
 ['Hari', 34, 'Lalitpur']]

In [26]:
# Write into CSV File
import csv
data = [['name','age','add'],
        ['Ram' , 34 , 'Kathmandu'],
        ['Shyam', 56 , 'Bhaktapur'],
        ['Hari', 34 , 'Lalitpur']]

file = open('list_data.csv','w')
x = csv.writer(file)
x.writerows(data)
file.close()

df = pd.read_csv('Data\list_data.csv')
df

   sn   name  age        add
0   1    Ram   34  Kathmandu
1   2  Shyam   56  Bhaktapur
2   3   Hari   34   Lalitpur

In [27]:
df = pd.read_csv('Data\list_data.csv')
df

   sn   name  age        add
0   1    Ram   34  Kathmandu
1   2  Shyam   56  Bhaktapur
2   3   Hari   34   Lalitpur

In [19]:
df.values

array([[1, 'Ram', 34, 'Kathmandu'],
       [2, 'Shyam', 56, 'Bhaktapur'],
       [3, 'Hari', 34, 'Lalitpur']], dtype=object)

In [20]:
df.columns

Index(['sn', 'name', 'age', 'add'], dtype='object')

In [28]:
import csv 
data = []
file =  open('Data\list_data.csv','r')
reader = csv.DictReader(file)
for row in reader:
    data.append(row)
file.close()
data

[{'sn': '1', 'name': 'Ram', 'age': '34', 'add': 'Kathmandu'},
 {'sn': '2', 'name': 'Shyam', 'age': '56', 'add': 'Bhaktapur'},
 {'sn': '3', 'name': 'Hari', 'age': '34', 'add': 'Lalitpur'}]

In [29]:
import csv
csv_columns = ['Name', 'Age', 'Address']
dict = [
    {'Name':'Ayush','Age':23,'Address':'Kathmandu'},
    {'Name':'Shyam','Age':33,'Address':'Patan'}
]
file = open("Data\data.csv",'w')

writer = csv.DictWriter(file,fieldnames=csv_columns)
writer.writeheader()
writer.writerows(dict)
    
file.close()

In [30]:
import pandas as pd
df = pd.read_csv('Data\data.csv')
df

    Name  Age    Address
0  Ayush   23  Kathmandu
1  Shyam   33      Patan

In [34]:
# Concat Dataframes
df1 = pd.DataFrame( {'name' : ['Ram','Shyam','Hari'],
                     'age' : [34,56,34],
                     'add' : ['Kathmandu' , 'Bhaktapur' , 'Lalitpur']} )

df2 = pd.DataFrame( {'name' : ['Ram','Shyam','Hari'],
                      'age' : [34,56,34],
                      'add' : ['Kathmandu' , 'Bhaktapur' , 'Lalitpur']})

df = pd.concat([df1,df2])
df

    name  age        add
0    Ram   34  Kathmandu
1  Shyam   56  Bhaktapur
2   Hari   34   Lalitpur
0    Ram   34  Kathmandu
1  Shyam   56  Bhaktapur
2   Hari   34   Lalitpur